In [1]:
import json 
import pandas as pd 
import numpy as np
from pprint import pprint

In [2]:
f = open('In-Class.json', "r" )

In [3]:
data = json.loads(f.read())

In [4]:
df = pd.read_json('In-Class.json', orient = 'split')

In [5]:
df.head(2)

,title,id,revenue,genres,belongs_to_collection,runtime
0,Avengers: Endgame,299534,2797800564,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...","{'id': 86311, 'name': 'The Avengers Collection...",181
1,Avatar,19995,2787965087,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 87096, 'name': 'Avatar Collection', 'po...",162

### creating a column runtime_increment of 10% of runtime

In [6]:
df['runtime_increment'] =  df['runtime']*0.1 + df['runtime']

In [7]:
df.runtime_increment.head(3)

0    199.1
1    178.2
2    149.6
Name: runtime_increment, dtype: float64

In [8]:
df.head(3)

,title,id,revenue,genres,belongs_to_collection,runtime,runtime_increment
0,Avengers: Endgame,299534,2797800564,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...","{'id': 86311, 'name': 'The Avengers Collection...",181,199.1
1,Avatar,19995,2787965087,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 87096, 'name': 'Avatar Collection', 'po...",162,178.2
2,Star Wars: The Force Awakens,140607,2068223624,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 10, 'name': 'Star Wars Collection', 'po...",136,149.6

### Using the apply method to create a new column of runtime with 10% increment

In [9]:
df['runtime_increment2'] = df.runtime.apply(lambda x: x*0.1 + x)

In [10]:
df.runtime_increment2.head(3)

0    199.1
1    178.2
2    149.6
Name: runtime_increment2, dtype: float64

### Creating a dataframe from the belongs_to_collection column

In [11]:
type(df.belongs_to_collection)

pandas.core.series.Series

In [12]:
pd.DataFrame(data = df['belongs_to_collection'], columns = ['id','name','poster_path','backdrop_path'])

Empty DataFrame
Columns: [id, name, poster_path, backdrop_path]
Index: []

In [13]:
df.belongs_to_collection[0]

{'id': 86311,
 'name': 'The Avengers Collection',
 'poster_path': '/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg',
 'backdrop_path': '/zuW6fOiusv4X9nnW3paHGfXcSll.jpg'}

### belongs_to_collection from series to dictionary

In [17]:
df2  = df.belongs_to_collection.to_dict()

### belongs_to_collection from dictionary to DataFrame

In [22]:
df2 = pd.DataFrame.from_dict(df2).T

In [23]:
df2.head(3)

,backdrop_path,id,name,poster_path
0,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
1,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg
2,/d8duYyyC9J5T825Hg7grmaabfxQ.jpg,10,Star Wars Collection,/iTQHKziZy9pAAY4hHEDCGPaOvFC.jpg

<h2 style="color: red">Checking The Data Type of df2</h2>

In [24]:
type(df2)

pandas.core.frame.DataFrame

<h1 style="color:cornflowerblue; text-align: center">Think of this again</h1>

# 1. dataframe from belongs_to_collection
# 2. dataframe from the genres